#+title: Work Log
Keeping track of what I'm doing without cluttering up README.org.
* DONE Fix row allocation bug
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-16 Fri 10:21] \\
  This bug is not real, only size: 0 is
CLOCK: [2024-02-16 Fri 09:50]--[2024-02-16 Fri 10:15] =>  0:25
:END:
* DONE Fix "Size 0, Alignment 0" bug
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-16 Fri 10:58] \\
  This was stupid, I was appending to the component_columns Vector for
  the [Storage] archetype rather than setting the value at index 0, that
  corresponds to the Storage Component.
CLOCK: [2024-02-16 Fri 10:21]--[2024-02-16 Fri 10:46] =>  0:25
:END:
This is probably the same as the previous bug.
* DONE Storage for Pairs
:LOGBOOK:
CLOCK: [2024-02-16 Fri 11:02]--[2024-02-16 Fri 11:27] =>  0:25
:END:
Our simplified mechanism for determining storage of a pair type:
Inherit from the Relation type.
This is implemented in ~ecs_get~.
* TODO Queries and Systems
:LOGBOOK:
CLOCK: [2024-02-19 Mon 16:59]--[2024-02-19 Mon 17:24] =>  0:25
CLOCK: [2024-02-19 Mon 16:12]--[2024-02-19 Mon 16:37] =>  0:25
CLOCK: [2024-02-19 Mon 15:41]--[2024-02-19 Mon 16:06] =>  0:25
CLOCK: [2024-02-19 Mon 15:02]--[2024-02-19 Mon 15:27] =>  0:25
CLOCK: [2024-02-19 Mon 14:30]--[2024-02-19 Mon 14:55] =>  0:25
CLOCK: [2024-02-16 Fri 13:33]--[2024-02-16 Fri 13:58] =>  0:25
CLOCK: [2024-02-16 Fri 13:02]--[2024-02-16 Fri 13:27] =>  0:25
:END:
- [ ] Nice API for accessing data from Systems?
